LQM2015/stm32/Core/Src/audio_recorder.c
/**
 * @file audio_recorder.c
 * @brief Audio recorder implementation for I2S TDM PCM data recording
 * @date 2025-01-28
 */

/* Includes ------------------------------------------------------------------*/
#include "../Inc/audio_recorder.h"
#include "../Inc/flash_storage.h"  // Add flash storage support
#include "sai.h"
#include "fatfs.h"
#include "shell_log.h"
#include "fs_manager.h"
#include "diskio.h"  // For SD card status checking
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include "cmsis_os.h"
#include "stm32h7xx_hal.h" // For SCB_InvalidateDCache_by_Addr

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static AudioPcmMode_t s_audio_mode = AUDIO_MODE_I2S_STEREO;

static const AudioPcmConfig_t s_pcm_profiles[AUDIO_MODE_COUNT] = {
    [AUDIO_MODE_I2S_STEREO] = {
        .mode = AUDIO_MODE_I2S_STEREO,
        .name = "I2S_STEREO",
        .channels = 2,
        .bit_depth = AUDIO_SUPPORTED_BIT_DEPTH,
        .sample_rate = 16000U,
        .buffer_frames = AUDIO_DMA_BUFFER_FRAMES,
        .sai_protocol = SAI_I2S_STANDARD,
        .sai_datasize = SAI_PROTOCOL_DATASIZE_16BIT,
        .slot_active_mask = (1U << 2) - 1U,
    },
    [AUDIO_MODE_I2S_TDM] = {
        .mode = AUDIO_MODE_I2S_TDM,
        .name = "I2S_TDM",
        .channels = AUDIO_MAX_CHANNELS,
        .bit_depth = AUDIO_SUPPORTED_BIT_DEPTH,
        .sample_rate = 16000U,
        .buffer_frames = AUDIO_DMA_BUFFER_FRAMES,
        .sai_protocol = SAI_PCM_SHORT,
        .sai_datasize = SAI_PROTOCOL_DATASIZE_16BIT,
        .slot_active_mask = (1U << AUDIO_MAX_CHANNELS) - 1U,
    },
};

// 独立的文件对象，避免与录音器结构体混在一起被踩踏
static FIL g_audio_file __attribute__((section(".dma_buffer"))) __attribute__((aligned(32)));

// 音频录制器实例，使用DMA安全的内存区域
#if defined ( __GNUC__ )
__attribute__((section(".dma_buffer"), aligned(32)))
#endif
static AudioRecorder_t recorder = {0};
/* DMA buffer: placed in .dma_buffer (linker -> D3 SRAM 0x38000000) with 32-byte alignment.
 * Region configured via MPU (Region7) as non-cacheable & shareable, so no runtime cache maintenance required.
 * Rationale: BDMA cannot access DTCM; non-cacheable removes need for Clean/Invalidate calls.
 * Buffer size is calculated based on AUDIO_CHANNELS and AUDIO_BUFFER_FRAMES configuration.
 */
#if defined ( __GNUC__ )
__attribute__((section(".dma_buffer"), aligned(32)))
#endif
static uint16_t audio_buffer[AUDIO_DMA_BUFFER_SAMPLES_MAX]; // 16-bit samples interleaved multi-channel data

// 队列数据结构定义 - 简化设计，直接包含数据
typedef struct {
    uint16_t data[AUDIO_DMA_HALF_BUFFER_SIZE_MAX / 2];  // 直接内嵌数据缓冲区 (16-bit samples)
    uint32_t data_size;    // 数据大小（字节）
    uint32_t timestamp;    // 时间戳
    bool is_half_buffer;   // true: 前半缓冲区, false: 后半缓冲区
    uint8_t padding[3];    // 对齐填充
} __attribute__((aligned(32))) AudioDataItem_t;

#define AUDIO_QUEUE_SIZE 6  // 减少队列深度，每个项包含4KB数据

static osMessageQueueId_t audio_data_queue = NULL;
static osThreadId_t audio_process_thread_id = NULL;

// 降低SAI回调打印频次的计数器
static uint32_t rx_complete_counter = 0;
static uint32_t rx_half_counter = 0;
#define RX_CALLBACK_LOG_INTERVAL 50  // 每50次回调打印一次

// External variables from fatfs
extern FATFS USERFatFS;
extern char USERPath[4];

/* Private function prototypes -----------------------------------------------*/
static void generate_filename(char* filename, size_t size);
static int write_audio_data(uint16_t* data, uint32_t size);
static void debug_sai_status(void);
static void monitor_sai_timing(void);
static void reset_sai_timing_status(void);
void audio_recorder_process(void);
static int check_sd_card_status(void);
static void audio_process_thread(void *argument);
static int verify_file_exists(const char* filepath);
static void measure_external_clock_frequency(void);

static const AudioPcmConfig_t* resolve_profile(AudioPcmMode_t mode)
{
    if (mode >= AUDIO_MODE_COUNT) {
        return NULL;
    }
    return &s_pcm_profiles[mode];
}

AudioPcmMode_t audio_recorder_get_mode(void)
{
    return s_audio_mode;
}

const AudioPcmConfig_t* audio_recorder_get_pcm_config(void)
{
    return resolve_profile(s_audio_mode);
}

const AudioPcmConfig_t* audio_recorder_get_pcm_config_for_mode(AudioPcmMode_t mode)
{
    return resolve_profile(mode);
}

uint32_t audio_recorder_get_channel_count(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->channels : 0U;
}

uint32_t audio_recorder_get_sample_rate(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->sample_rate : 0U;
}

uint32_t audio_recorder_get_bit_depth(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->bit_depth : AUDIO_SUPPORTED_BIT_DEPTH;
}

uint32_t audio_recorder_get_bytes_per_frame(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    if (cfg == NULL) {
        return 0U;
    }
    return cfg->channels * (cfg->bit_depth / 8U);
}

uint32_t audio_recorder_get_total_buffer_bytes(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    if (cfg == NULL) {
        return 0U;
    }
    return cfg->buffer_frames * audio_recorder_get_bytes_per_frame();
}

uint32_t audio_recorder_get_half_buffer_bytes(void)
{
    return audio_recorder_get_total_buffer_bytes() / 2U;
}

uint32_t audio_recorder_get_total_buffer_samples(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    if (cfg == NULL || cfg->bit_depth == 0U) {
        return 0U;
    }
    uint32_t bytes_per_sample = cfg->bit_depth / 8U;
    return audio_recorder_get_total_buffer_bytes() / bytes_per_sample;
}

uint32_t audio_recorder_get_half_buffer_samples(void)
{
    return audio_recorder_get_total_buffer_samples() / 2U;
}

uint32_t audio_recorder_get_slot_active_mask(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->slot_active_mask : 0U;
}

uint32_t audio_recorder_get_sai_protocol(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->sai_protocol : SAI_I2S_STANDARD;
}

uint32_t audio_recorder_get_sai_datasize(void)
{
    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    return cfg ? cfg->sai_datasize : SAI_PROTOCOL_DATASIZE_16BIT;
}

HAL_StatusTypeDef audio_recorder_set_mode(AudioPcmMode_t mode)
{
    if (mode >= AUDIO_MODE_COUNT) {
        SHELL_LOG_USER_ERROR("Invalid audio mode: %d", mode);
        return HAL_ERROR;
    }

