LQM2015/stm32/Core/Src/audio_recorder.c
    if ((recorder.state == AUDIO_REC_RECORDING) || (recorder.state == AUDIO_REC_STOPPING)) {
        SHELL_LOG_USER_WARNING("Cannot switch audio mode while recording (state=%d)", recorder.state);
        return HAL_BUSY;
    }

    if (mode == s_audio_mode) {
        return HAL_OK;
    }

    const AudioPcmConfig_t* cfg = resolve_profile(mode);
    if (cfg == NULL) {
        SHELL_LOG_USER_ERROR("Failed to resolve audio profile for mode %d", mode);
        return HAL_ERROR;
    }

    s_audio_mode = mode;

    recorder.channels = cfg->channels;
    recorder.bit_depth = cfg->bit_depth;
    recorder.sample_rate = cfg->sample_rate;
    recorder.buffer_size = audio_recorder_get_total_buffer_bytes();

    if (recorder.file_open) {
        SHELL_LOG_USER_WARNING("Audio file still open while switching mode; closing reference");
        recorder.file_open = false;
    }

    /* Reconfigure SAI peripheral to apply the new audio profile */
    MX_SAI4_Init();

    SHELL_LOG_USER_INFO("Audio mode switched to %s (%d ch, %d-bit, %lu Hz)",
                        cfg->name,
                        cfg->channels,
                        cfg->bit_depth,
                        (unsigned long)cfg->sample_rate);

    return HAL_OK;
}

/* Private functions ---------------------------------------------------------*/

/**
 * @brief Generate filename based on audio parameters
 * @param filename: Buffer to store filename
 * @param size: Buffer size
 */
static void generate_filename(char* filename, size_t size)
{
    // For now, use a simple counter-based naming
    static uint32_t file_counter = 0;
    file_counter++;

    const AudioPcmConfig_t* cfg = audio_recorder_get_pcm_config();
    uint32_t channels = cfg ? cfg->channels : audio_recorder_get_channel_count();
    uint32_t bit_depth = cfg ? cfg->bit_depth : audio_recorder_get_bit_depth();
    uint32_t sample_rate = cfg ? cfg->sample_rate : audio_recorder_get_sample_rate();
    
    snprintf(filename, size, "audio_%dch_%dbit_%dHz_%03lu.pcm", 
             (int)channels, (int)bit_depth, (int)sample_rate, file_counter);
}

/**
 * @brief Write audio data to SD card
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error
 */
/**
 * @brief Write audio data to storage (TF card or Flash)
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error, -2: Reentry conflict
 */
static int write_audio_data(uint16_t* data, uint32_t size)
{
    // Check for reentrant calls - prevent interrupt collision
    if (recorder.write_in_progress) {
        // Reentry conflict: return special value -2, different from real write error -1
        return -2;  // Reentry conflict
    }
    
    // Set write-in-progress flag
    recorder.write_in_progress = true;
    
    int result = 0;
    
    if (recorder.use_flash_recording) {
        // Flash recording mode
        SHELL_LOG_USER_DEBUG("Writing %lu bytes to Flash", (unsigned long)size);
        
        FlashStorageStatus_t flash_status = flash_storage_write_audio_data((uint8_t*)data, size);
        
        if (flash_status == FLASH_STORAGE_OK) {
            recorder.flash_bytes_written += size;
            SHELL_LOG_USER_DEBUG("Flash write successful, total: %lu bytes", 
                                (unsigned long)recorder.flash_bytes_written);
        } else if (flash_status == FLASH_STORAGE_FULL) {
            SHELL_LOG_USER_WARNING("Flash is full! Written: %lu bytes", 
                                  (unsigned long)recorder.flash_bytes_written);
            recorder.write_in_progress = false;
            
            if (recorder.flash_auto_stop) {
                SHELL_LOG_USER_INFO("Auto-stopping recording due to full Flash");
                // Set flag to stop recording in the main thread
                recorder.state = AUDIO_REC_STOPPING;
            }
            return -1;  // Flash full is treated as error for flow control
        } else {
            SHELL_LOG_USER_ERROR("Flash write failed, status: %d", flash_status);
            recorder.write_in_progress = false;
            return -1;
        }
    } else {
        // Traditional TF card recording mode
        UINT bytes_written;
        FRESULT res;
        
        if (!recorder.file_open) {
            SHELL_LOG_USER_ERROR("Cannot write data, file not open");
            recorder.write_in_progress = false;
            return -1;
        }
        
        // Simple file object validity check
        if (g_audio_file.obj.fs == NULL) {
            SHELL_LOG_USER_ERROR("File object invalid - filesystem pointer is NULL");
            recorder.file_open = false;
            recorder.write_in_progress = false;
            return -1;
        }
        
        vTaskDelay(4); // Delay to ensure filesystem stability
        
        // Write directly, remove interrupt disable to avoid affecting SD card DMA
        res = f_write(&g_audio_file, data, size, &bytes_written);
        
        if (res == FR_OK && bytes_written == size) {
            // Success - update counters
            recorder.bytes_written += bytes_written;
        } else {
            SHELL_LOG_USER_ERROR("Write failed, FRESULT: %d, expected: %lu, written: %lu", 
                                res, (unsigned long)size, (unsigned long)bytes_written);
            recorder.write_in_progress = false;
            return -1;
        }
    }
    
    // Clear write-in-progress flag before returning
    recorder.write_in_progress = false;
    return result;
}

/**
 * @brief Debug SAI and DMA status
 */
static void debug_sai_status(void)
{
    SHELL_LOG_USER_DEBUG("=== SAI Status Debug ===");
    SHELL_LOG_USER_DEBUG("SAI State: %d", HAL_SAI_GetState(&hsai_BlockA4));
    SHELL_LOG_USER_DEBUG("SAI Error Code: 0x%08lX", hsai_BlockA4.ErrorCode);
    
    // Decode SAI error codes
    if (hsai_BlockA4.ErrorCode != HAL_SAI_ERROR_NONE) {
        SHELL_LOG_USER_ERROR("=== SAI Error Analysis ===");
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("- Overrun Error detected");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("- Underrun Error detected");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
            SHELL_LOG_USER_ERROR("- Anticipated Frame Sync Detection Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("- Late Frame Sync Detection Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_CNREADY) {
            SHELL_LOG_USER_ERROR("- Codec Not Ready Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("- Wrong Clock Configuration Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_TIMEOUT) {
            SHELL_LOG_USER_ERROR("- Timeout Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_DMA) {
            SHELL_LOG_USER_ERROR("- DMA Error");
        }
    }
    
    // Check DMA status if available
    if (hsai_BlockA4.hdmarx != NULL) {
        SHELL_LOG_USER_DEBUG("DMA State: %d", HAL_DMA_GetState(hsai_BlockA4.hdmarx));
        SHELL_LOG_USER_DEBUG("DMA Error Code: 0x%08lX", hsai_BlockA4.hdmarx->ErrorCode);
        
        // Decode DMA error codes
        if (hsai_BlockA4.hdmarx->ErrorCode != HAL_DMA_ERROR_NONE) {
            SHELL_LOG_USER_ERROR("=== DMA Error Analysis ===");
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_TE) {
                SHELL_LOG_USER_ERROR("- DMA Transfer Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_FE) {
                SHELL_LOG_USER_ERROR("- DMA FIFO Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_DME) {
                SHELL_LOG_USER_ERROR("- DMA Direct Mode Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_TIMEOUT) {
                SHELL_LOG_USER_ERROR("- DMA Timeout Error");
            }
        }
    } else {
        SHELL_LOG_USER_WARNING("DMA handle is NULL");
    }
    
