LQM2015/stm32/Core/Src/audio_recorder.c
    // Check and fix SD card status first
    if (check_sd_card_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card is not ready for recording");
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
    
    // Reset SAI timing status and clear any error flags
    reset_sai_timing_status();

    /* Ensure SAI instance is aligned with the current audio profile */
    MX_SAI4_Init();
    
    // Check if SD card is mounted first
    SHELL_LOG_USER_DEBUG("Checking SD card mount status via global fs manager...");
    
    if (fs_manager_check_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card not accessible via global fs manager");
        
        // 尝试通过文件系统管理器修复
        SHELL_LOG_USER_INFO("Attempting to fix SD card access via global fs manager...");
        
        if (fs_manager_remount() != 0) {
            SHELL_LOG_USER_ERROR("Failed to fix SD card access");
            recorder.state = AUDIO_REC_ERROR;
            return -1;
        }
        
        SHELL_LOG_USER_INFO("SD card access restored via global fs manager");
    } else {
        SHELL_LOG_USER_INFO("SD card is accessible via global fs manager");
    }
    
    // 关键修复：在每次开始录音前重新初始化文件对象
    SHELL_LOG_USER_DEBUG("Reinitializing file object for clean state...");
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();  // 内存屏障确保清零完成
    __ISB();  // 指令屏障
    
    // Generate filename
    generate_filename(recorder.filename, sizeof(recorder.filename));
    SHELL_LOG_USER_INFO("Generated filename: %s", recorder.filename);
    
    // Try with directory path
    char full_path[64];
    snprintf(full_path, sizeof(full_path), "%s", recorder.filename);
    SHELL_LOG_USER_INFO("Attempting to open file: %s", full_path);
    
    // Open file for writing (禁用中断保护文件系统操作)
    uint32_t open_primask = __get_PRIMASK();
    __disable_irq();
    
    res = f_open(&g_audio_file, full_path, FA_CREATE_ALWAYS | FA_WRITE);
    
    __DSB();  // 确保文件打开完成
    __set_PRIMASK(open_primask);  // 恢复中断
    
    SHELL_LOG_USER_INFO("f_open result: %d for path: %s", res, full_path);
    
    if (res == FR_OK) {
        // 立即同步文件以确保创建 (也需要中断保护)
        uint32_t sync_primask = __get_PRIMASK();
        __disable_irq();
        
        FRESULT sync_res = f_sync(&g_audio_file);
        
        __DSB();
        __set_PRIMASK(sync_primask);
        SHELL_LOG_USER_INFO("f_sync after create result: %d", sync_res);
        
        // 简化：不再写入测试数据，避免扰乱实际PCM文件内容
    }
    
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("Failed to open file in / directory, FRESULT: %d", res);
        SHELL_LOG_USER_INFO("Trying to open file in root directory...");
        
        // 第二次尝试也需要中断保护
        uint32_t retry_primask = __get_PRIMASK();
        __disable_irq();
        
        res = f_open(&g_audio_file, recorder.filename, FA_CREATE_ALWAYS | FA_WRITE);
        
        __DSB();
        __set_PRIMASK(retry_primask);
        
        if (res != FR_OK) {
            SHELL_LOG_USER_ERROR("Failed to open file in root directory, FRESULT: %d", res);
            
            // Print detailed error information
            switch(res) {
                case FR_NO_FILE:
                    SHELL_LOG_USER_ERROR("Error: No file found");
                    break;
                case FR_NO_PATH:
                    SHELL_LOG_USER_ERROR("Error: No path found");
                    break;
                case FR_INVALID_NAME:
                    SHELL_LOG_USER_ERROR("Error: Invalid filename");
                    break;
                case FR_DENIED:
                    SHELL_LOG_USER_ERROR("Error: Access denied");
                    break;
                case FR_NOT_READY:
                    SHELL_LOG_USER_ERROR("Error: Drive not ready");
                    break;
                case FR_WRITE_PROTECTED:
                    SHELL_LOG_USER_ERROR("Error: Write protected");
                    break;
                case FR_DISK_ERR:
                    SHELL_LOG_USER_ERROR("Error: Disk error");
                    break;
                case FR_NOT_ENABLED:
                    SHELL_LOG_USER_ERROR("Error: Volume not enabled");
                    break;
                case FR_NO_FILESYSTEM:
                    SHELL_LOG_USER_ERROR("Error: No filesystem");
                    break;
                default:
                    SHELL_LOG_USER_ERROR("Error: Unknown error code %d", res);
                    break;
            }
            
            recorder.state = AUDIO_REC_ERROR;
            return -1;
        } else {
            SHELL_LOG_USER_INFO("File opened successfully in root directory");
            // Keep original filename (no need to copy to itself)
        }
    } else {
        SHELL_LOG_USER_INFO("File opened successfully in / directory");
        strcpy(recorder.filename, full_path); // Update to full path
    }
    
    recorder.file_open = true;
    recorder.bytes_written = 0;
    recorder.write_in_progress = false;  // Initialize write protection flag
    
    // 验证文件是否真的创建成功 - 通过获取文件大小而不是重新打开
    FSIZE_t current_size = f_size(&g_audio_file);
    SHELL_LOG_USER_INFO("File created successfully, current size: %lu bytes", (unsigned long)current_size);
    
    // 记录实际使用的文件路径
    const char* actual_path = (res == FR_OK && strstr(full_path, "audio/")) ? full_path : recorder.filename;
    SHELL_LOG_USER_INFO("File path being used: %s", actual_path);
    
    // 确保状态正确设置为录音中
    recorder.state = AUDIO_REC_RECORDING;
    SHELL_LOG_USER_DEBUG("State set to RECORDING: %d", recorder.state);
    
    // Start SAI DMA reception
    SHELL_LOG_USER_INFO("Starting SAI DMA reception, buffer size: %lu samples (%lu bytes)", 
                        (unsigned long)audio_recorder_get_total_buffer_samples(),
                        (unsigned long)audio_recorder_get_total_buffer_bytes());
    SHELL_LOG_USER_DEBUG("SAI handle: %p, buffer address: %p", &hsai_BlockA4, audio_buffer);
    SHELL_LOG_USER_DEBUG("SAI state before start: %d", HAL_SAI_GetState(&hsai_BlockA4));

