LQM2015/stm32/Core/Src/audio_recorder.c
    for (;;) {
        // Wait for audio data from the queue (blocking)
        osStatus_t status = osMessageQueueGet(audio_data_queue, &audio_item, NULL, osWaitForever);
        
        if (status == osOK) {
            //SHELL_LOG_USER_DEBUG("Processing audio data: %lu bytes", (unsigned long)audio_item.data_size);
            
            // Check if we're still recording
            if (recorder.state == AUDIO_REC_RECORDING) {
                // Process the received audio data
                int write_result = write_audio_data(audio_item.data, audio_item.data_size);
                
                if (write_result == -1) {
                    // 真正的写入错误
                    SHELL_LOG_USER_ERROR("Failed to write %s buffer, stopping recording.", 
                                        audio_item.is_half_buffer ? "first half" : "second half");
                    int stop_result = audio_recorder_stop();
                    if (stop_result != 0) {
                        recorder.state = AUDIO_REC_ERROR;
                    }
                } else if (write_result == -2) {
                    // 重入冲突，跳过但不设置错误状态
                    SHELL_LOG_USER_DEBUG("%s buffer write skipped due to reentry conflict",
                                        audio_item.is_half_buffer ? "First half" : "Second half");
                } else {
                    // 写入成功
                    // SHELL_LOG_USER_DEBUG("%s buffer written successfully",
                    //                     audio_item.is_half_buffer ? "First half" : "Second half");
                }
            } else {
                // 不在录音状态，丢弃数据
                SHELL_LOG_USER_DEBUG("Discarding audio data - not in recording state (state=%d)", recorder.state);
            }
        } else {
            SHELL_LOG_USER_WARNING("Failed to get audio data from queue, status: %d", status);
            // 短暂延时后继续
            osDelay(1);
        }
    }
}

/**
 * @brief Process audio data buffers. 
 * @note This function is now simplified as audio processing is handled by the queue-based thread.
 *       It only monitors SAI timing status.
 */
void audio_recorder_process(void)
{
    if (recorder.state != AUDIO_REC_RECORDING) {
        return;
    }

    // Monitor SAI timing status for Late Frame Sync issues
    monitor_sai_timing();
    
    // Note: Audio data processing is now handled by the audio_process_thread 
    // via queue mechanism for better real-time performance and data integrity.
}

/* Callback functions --------------------------------------------------------*/

/**
 * @brief SAI RX complete callback
 */
void audio_recorder_rx_complete_callback(void)
{
    /* Keep callbacks lightweight: reduced debug log frequency */
    rx_complete_counter++;
    if (rx_complete_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX complete (%lu)", (unsigned long)rx_complete_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        //SHELL_LOG_USER_DEBUG("RX complete callback triggered");
        
        // 准备队列数据项 - 后半缓冲区
        AudioDataItem_t audio_item;
        
    uint32_t half_bytes = audio_recorder_get_half_buffer_bytes();
    uint32_t half_samples = audio_recorder_get_half_buffer_samples();

    // 复制DMA数据到独立缓冲区，避免被硬件覆盖
    uint16_t* source_ptr = &audio_buffer[half_samples];  // 后半缓冲区
    memcpy(audio_item.data, source_ptr, half_bytes);
        __DSB();  // 确保内存复制完成
        
    audio_item.data_size = half_bytes;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = false;  // 完整回调 = 后半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count = 0;
            queue_full_count++;
            if (queue_full_count % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX complete callback! Lost count: %lu", queue_full_count);
            }
        } else {
            //SHELL_LOG_USER_DEBUG("Data queued successfully in RX complete");
        }
    }
}

/**
 * @brief SAI RX half complete callback
 */
void audio_recorder_rx_half_complete_callback(void)
{
    /* Half complete - reduced debug log frequency */
    rx_half_counter++;
    if (rx_half_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX half (%lu)", (unsigned long)rx_half_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        // 准备队列数据项 - 前半缓冲区
        AudioDataItem_t audio_item;
        
    uint32_t half_bytes = audio_recorder_get_half_buffer_bytes();

    // 复制DMA数据到独立缓冲区，避免被硬件覆盖
    uint16_t* source_ptr = &audio_buffer[0];  // 前半缓冲区
    memcpy(audio_item.data, source_ptr, half_bytes);
        __DSB();  // 确保内存复制完成
        
    audio_item.data_size = half_bytes;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = true;   // 半完成回调 = 前半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count_half = 0;
            queue_full_count_half++;
            if (queue_full_count_half % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX half callback! Lost count: %lu", queue_full_count_half);
            }
        }
    }
}

/**
 * @brief SAI error callback
 */
void audio_recorder_error_callback(void)
{
    SHELL_LOG_USER_ERROR("SAI error callback triggered! (state=%d)", recorder.state);
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        SHELL_LOG_USER_ERROR("SAI error during recording, stopping...");
        
        // Print detailed status at the moment of error
        debug_sai_status();
        
        // Check and provide specific error guidance
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("Late Frame Sync detected");
            SHELL_LOG_USER_ERROR("Suggestions:");
            SHELL_LOG_USER_ERROR("1. Check external I2S clock stability");
            SHELL_LOG_USER_ERROR("2. Verify SAI configuration matches hardware");
            SHELL_LOG_USER_ERROR("3. Consider reducing DMA transfer size");
            SHELL_LOG_USER_ERROR("4. Check for SD card write bottlenecks");
            
            // Try to clear the error and continue if possible
            __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET);
            hsai_BlockA4.ErrorCode &= ~HAL_SAI_ERROR_LFSDET;
            
            // Don't immediately stop - try to recover
            SHELL_LOG_USER_WARNING("Attempting to continue recording after LFSDET error");
            return;
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
            SHELL_LOG_USER_ERROR("Anticipated Frame Sync detected - frame timing issue");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI frame configuration and external codec");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("SAI Overrun - data not read fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and buffer handling");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("SAI Underrun - data not supplied fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and data flow");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("Wrong Clock Configuration detected");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI clock settings and PLL configuration");
        }
        
        recorder.state = AUDIO_REC_ERROR;
        
