LQM2015/stm32/Core/Src/audio_recorder.c
        // Stop DMA and close file
        HAL_SAI_DMAStop(&hsai_BlockA4);
        // if (recorder.file_open) {
        //     f_close(&recorder.file);
        //     recorder.file_open = false;
        // }
        
        SHELL_LOG_USER_ERROR("Recording stopped due to SAI error");
    }
}

/* Flash-based recording functions -------------------------------------------*/

/**
 * @brief Start recording to Flash instead of TF card
 * @retval 0: Success, -1: Error
 */
int audio_recorder_start_flash_recording(void)
{
    SHELL_LOG_USER_INFO("Starting Flash-based audio recording...");
    
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_WARNING("Recorder not in idle state (%d), attempting force reset...", recorder.state);
        audio_recorder_reset();
    }
    
    // Check Flash availability
    if (!flash_storage_get_available_space()) {
        SHELL_LOG_USER_ERROR("Flash storage not available or full");
        return -1;
    }
    
    // Generate filename for later use
    generate_filename(recorder.filename, sizeof(recorder.filename));
    SHELL_LOG_USER_INFO("Generated filename for later copy: %s", recorder.filename);
    
    // Configure recorder for Flash mode
    recorder.use_flash_recording = true;
    recorder.flash_bytes_written = 0;
    recorder.flash_auto_stop = true;
    recorder.file_open = false;  // No file open in Flash mode
    recorder.bytes_written = 0;
    
    // Set state and start SAI
    recorder.state = AUDIO_REC_FLASH_RECORDING;
    
    // Reset SAI timing status and clear any error flags
    reset_sai_timing_status();
    
    // Ensure SAI instance is aligned with the current audio profile
    MX_SAI4_Init();
    
    // Clear audio buffer
    memset(audio_buffer, 0, sizeof(audio_buffer));
    
    SHELL_LOG_USER_INFO("Starting SAI DMA reception for Flash recording...");
    HAL_StatusTypeDef sai_result = HAL_SAI_Receive_DMA(&hsai_BlockA4,
                                                      (uint8_t*)audio_buffer,
                                                      audio_recorder_get_total_buffer_samples());
    
    if (sai_result != HAL_OK) {
        SHELL_LOG_USER_ERROR("Failed to start SAI DMA reception, HAL result: %d", sai_result);
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
    
    uint32_t available_space = flash_storage_get_available_space();
    SHELL_LOG_USER_INFO("Flash recording started successfully, available space: %lu MB", 
                       available_space / (1024 * 1024));
    
    return 0;
}

/**
 * @brief Stop Flash recording and copy data to TF card
 * @retval 0: Success, -1: Error
 */
int audio_recorder_stop_and_copy_to_tf(void)
{
    SHELL_LOG_USER_INFO("Stopping Flash recording and copying to TF card...");
    
    if (recorder.state != AUDIO_REC_FLASH_RECORDING) {
        SHELL_LOG_USER_WARNING("Not in Flash recording state, current: %d", recorder.state);
        return -1;
    }
    
    recorder.state = AUDIO_REC_STOPPING;
    
    // Stop SAI DMA
    HAL_StatusTypeDef dma_result = HAL_SAI_DMAStop(&hsai_BlockA4);
    if (dma_result != HAL_OK) {
        SHELL_LOG_USER_WARNING("SAI DMA stop failed, result: %d", dma_result);
        // Try abort
        HAL_SAI_Abort(&hsai_BlockA4);
    }
    
    // Wait for DMA to stop
    uint32_t timeout = HAL_GetTick() + 100;
    while (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY && HAL_GetTick() < timeout) {
        vTaskDelay(1);
    }
    
    SHELL_LOG_USER_INFO("Flash recording stopped. Total bytes in Flash: %lu", 
                       (unsigned long)recorder.flash_bytes_written);
    
    if (recorder.flash_bytes_written == 0) {
        SHELL_LOG_USER_WARNING("No data to copy from Flash");
        recorder.state = AUDIO_REC_IDLE;
        return 0;
    }
    
    // Check SD card status
    if (check_sd_card_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card not ready for copying");
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
    
    recorder.state = AUDIO_REC_COPYING_TO_TF;
    
    // Copy Flash data to TF card
    SHELL_LOG_USER_INFO("Copying %lu bytes from Flash to TF card...", 
                       (unsigned long)recorder.flash_bytes_written);
    
    FlashStorageStatus_t copy_status = flash_storage_copy_to_tf_card(recorder.filename);
    
    if (copy_status == FLASH_STORAGE_OK) {
        SHELL_LOG_USER_INFO("Successfully copied Flash data to TF card: %s", recorder.filename);
        recorder.bytes_written = recorder.flash_bytes_written;  // Update for status reporting
        recorder.state = AUDIO_REC_IDLE;
        return 0;
    } else {
        SHELL_LOG_USER_ERROR("Failed to copy Flash data to TF card, status: %d", copy_status);
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
}

/**
 * @brief Check if Flash is full
 * @retval bool True if full, false otherwise
 */
bool audio_recorder_is_flash_full(void)
{
    return flash_storage_is_full();
}

/**
 * @brief Get Flash usage in bytes
 * @retval uint32_t Bytes used in Flash
 */
uint32_t audio_recorder_get_flash_usage(void)
{
    return flash_storage_get_total_written();
}

/**
 * @brief Check if Flash recording mode is enabled
 * @retval bool True if using Flash, false if using TF card
 */
bool audio_recorder_is_using_flash(void)
{
    return recorder.use_flash_recording;
}

/**
 * @brief Get current Flash recording information
 * @param[out] info Pointer to structure to fill with info
 * @retval 0: Success, -1: Error
 */
int audio_recorder_get_flash_info(AudioFlashInfo_t *info)
{
    if (!info) {
        return -1;
    }
    
    info->is_enabled = recorder.use_flash_recording;
    info->bytes_written = recorder.flash_bytes_written;
    info->total_capacity = FLASH_STORAGE_TOTAL_SIZE;
    info->available_space = flash_storage_get_available_space();
    info->is_full = flash_storage_is_full();
    info->usage_percent = (recorder.flash_bytes_written * 100) / FLASH_STORAGE_TOTAL_SIZE;
    
    return 0;
}

/**
 * @brief Set Flash recording mode
 * @param enable True to enable Flash recording, false for TF card recording
 * @retval 0: Success, -1: Error  
 */
int audio_recorder_set_flash_mode(bool enable)
{
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_WARNING("Cannot change recording mode while active (state: %d)", recorder.state);
        return -1;
    }
    
    recorder.use_flash_recording = enable;
    SHELL_LOG_USER_INFO("Recording mode set to: %s", enable ? "Flash" : "TF Card");
    
    return 0;
}

/**
 * @brief Erase Flash for new recording
 * @retval 0: Success, -1: Error
 */
int audio_recorder_erase_flash(void)
{
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_ERROR("Cannot erase Flash while recording (state: %d)", recorder.state);
        return -1;
    }
    
    SHELL_LOG_USER_INFO("Erasing Flash for new recording...");
    
    FlashStorageStatus_t erase_status = flash_storage_erase_audio_area();
    
    if (erase_status == FLASH_STORAGE_OK) {
        recorder.flash_bytes_written = 0;
        SHELL_LOG_USER_INFO("Flash erased successfully");
        return 0;
    } else {
        SHELL_LOG_USER_ERROR("Flash erase failed, status: %d", erase_status);
        return -1;
    }
}
